export const fixType: Record<string, string> = {
  "301": "门",
  "302": "灯具",
  "303": "插座",
  "304": "开关",
  "305": "床",
  "306": "设备",
  "307": "窗户",
  "308": "天花板",
  "309": "墙面",
  "310": "地面",
  "311": "水池",
  "312": "阀门",
  "313": "花洒",
  "314": "马桶",
  "317": "水龙头",
  "318": "管道",
  "319": "线路",
  "320": "电箱",
  "321": "柜子",
  "322": "桌子",
  "323": "椅子",
  "324": "锁",
  "325": "栏杆",
  "326": "晾衣架",
  "327": "水表",
  "328": "地漏",
  "329": "设备房",
  "330": "其他"
}


export const fixTypeList = Object.keys(fixType).map(key => ({
  label: fixType[key],
  value: key
}))
